Documents/ПеремещениеТерминалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ПеремещениеТерминалов</Name>
			<BasedOn>
				<xr:Item>Catalog.Терминалы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДвижениеТерминалов</xr:Item>
				<xr:Item>InformationRegister.СвязиТерминаловИДоговоров</xr:Item>
				<xr:Item>InformationRegister.СведенияОДоговорАренды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущееНазваниеТерминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Терминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремКуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Откуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяМетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорАрендыПерем</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДвижениеТерминалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеТерминалов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Откуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Куда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Эксплуатация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорАрендРегистр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОтКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Терминалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДействующиеДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ДействующиеДоговора</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПеремещениеТерминалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПроцедурыФормы

	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		Объект.Дата = ТекущаяДата();
		ПроверкаТерминалаИПрисваиваниеМетки();	
	КонецПроцедуры

#КонецОбласти

#Область ПроцедурыРеквизитовФормы

	&НаКлиенте
	Процедура ПроверкаТерминалаИПрисваиваниеМетки()
		Если Не Объект.ТекущееНазваниеТерминала.Пустая() Тогда
			пр1 = ПолучитьТД(Объект.ТекущееНазваниеТерминала,Объект.Дата);
			если пр1.Эксплуатация = ложь тогда
				Объект.ТекущееНазваниеТерминала = null;
		 		Сообщить("Данный терминал еще не эксплуатируется");
			иначе
				ПрисвоитьМетку();
			КонецЕсли;
		КонецЕсли;
	КонецПроцедуры

	&НаКлиенте
	Процедура ПеремОткПриИзменении(Элемент)
		ПроверкаТерминалаИПрисваиваниеМетки();
	КонецПроцедуры

	&НаКлиенте
	Процедура ПрисвоитьМетку();
		Объект.Откуда = Объект.ТекущееНазваниеТерминала; 	
		Данные = ПолучитьТД(Объект.ТекущееНазваниеТерминала,Объект.Дата);
		ОтКого = Данные.Принял;
	КонецПроцедуры

	&НаКлиенте
	Процедура ДоговорАрендыПеремПриИзменении(Элемент)
		Объект.ПеремКуда = получитьАдресАренды(Объект.ДоговорАрендыПерем);
	КонецПроцедуры

	&НаКлиенте
	Процедура ДоговорАрендыПеремНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьПереченьДействующихДоговоров(Объект.Дата);
	КонецПроцедуры

#КонецОбласти

#Область НеобходимоПеренести

	&НаСервере
	Функция ПолучитьТД(Терминал, Дата)
		Отбор = Новый Структура;
		Отбор.Вставить("Терминал",Терминал);
		Данные = РегистрыСведений.ДвижениеТерминалов.ПолучитьПоследнее(Дата,Отбор);
		Возврат Данные;
	КонецФункции

	&НаСервере
	Функция получитьАдресАренды(СсылкаНаДоговор)
		Возврат СсылкаНаДоговор.ПолучитьОбъект().АдресУстановки;
	КонецФункции

	&НаСервере
	Функция ПолучитьПереченьДействующихДоговоров(Дата);
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ДействующиеДоговораСрезПоследних.Договор КАК Договор
		|ИЗ
		|	РегистрСведений.ДействующиеДоговора.СрезПоследних КАК ДействующиеДоговораСрезПоследних
		|ГДЕ
		|	ДействующиеДоговораСрезПоследних.Период <= &Дата");
		Запрос.УстановитьПараметр("Дата", Дата);
		Список = Новый СписокЗначений;
		МассивЗначений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Договор");
		Для Каждого Значение Из МассивЗначений Цикл
			Список.Добавить(Значение, Значение.Номер+", "+Значение.Дата+", Адрес: "+Значение.АдресУстановки);
		КонецЦикла;                           
		Возврат Список;
	КонецФункции

#КонецОбласти
